#include <stdio.h> 
#include <stdlib.h>
int main(void) {
	
//打出字串（1006）
   printf ("          1111111111          000000000000000000          000000000000000000          666666666666666666          \n");
   printf ("          1111111111          000000000000000000          000000000000000000          666666666666666666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          66666                       \n");
   printf ("          1111111111          0000          0000          0000         00000          666666666666666666          \n");
   printf ("          1111111111          0000          0000          0000         00000          666666666666666666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          0000          0000          0000         00000          66666        66666          \n");
   printf ("          1111111111          000000000000000000          000000000000000000          666666666666666666          \n");
   printf ("          1111111111          000000000000000000          000000000000000000          666666666666666666          \n");
   
//設定密碼
    int password =2024;
    int input;
    int attempts=0;
 
//使用迴圈
while(1){ 
   
//輸入密碼

    printf("請輸入4位數密碼: ");
    scanf("%d",&input);

//檢查密碼是否正確
    if (input == password) {
    printf("密碼正確 進入下一步驟");
    break;
} else
{ 
attempts++;
printf("密碼輸入錯誤\n");
printf("已經輸入錯誤%d次\n",attempts++);

if (attempts>=3){
	printf("已連續輸入錯誤3次\n");
	return 0;
}}
}
//清除螢幕 
   system ("CLS");
   
   
//螢幕出現主選單 
    printf("---------------------------\n");
    printf("|   a.畫出直角三角形      |\n");
    printf("|   b.顯示乘法表          |\n");
    printf("|   c.結束                |\n");
    printf("---------------------------\n");
   
    char ch;
    
    int i, j, n = 6;
        for (i = 1; i <= n; i++) {
            for (j = 1; j <= i; j++) {
                printf("*");
            }
//請輸入一個字串 
    printf("請輸入一個字串: ");
    scanf("%c", &ch);

//
     if (ch == 'A' || ch == 'a') {
        system("CLS");
    } else if (input >= 'a' && ch <= 'n') {
            printf("\n");
    } else if ( ch >= 'c' || ch <= 'c') {
        printf("   c  "
		       "  bc  "
		       " abc  ");
    } else if (ch >= 'n' && ch <= 'z'){
        printf("\n按下任意鍵返回");
    }
    
//按任何鍵後回到作業系統 
    printf("按任何鍵後回到作業系統\n");
    

return 0;
}} 



//心得:這次的作業有很多地方是我找不到錯誤也不知道該怎麼解決，我覺得這次的作業蠻有挑戰的，要抓錯、找到解決方法，每一步都要小心，我也在這次中學到分號後面是不可以有空格，否則就會有錯誤 
 

